app/models/concerns/current_cart.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2019-09-05 00:58:45.153002"], ["updated_at", "2019-09-05 00:58:45.153002"]]
---
	def set_cart
		@cart = Cart.find_by(user_id: current_user.id)
		if @cart == nil
			return @cart = Cart.create(user_id: current_user.id)