app/views/carts/show.html.erb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
	<div class="panier col-sm-12 col-md-6 col-lg-6">
		<% itemList = @cart_items.select{|cart_item| cart_item.cart_id == current_user.cart.id} %>

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" = $2 LIMIT $3  [["cart_id", 1], ["item_id", 20], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
				<div class="itemInCart">
					<h4><%= Item.find_by(id: cart_item.item_id).title %></h4>
					<p> prix: <em> <%= Item.find_by(id: cart_item.item_id).price %>€ </em>, quantité: <%= CartItem.find_by(cart_id: current_user.cart.id, item_id: cart_item.item_id).quantity %></p>