app/controllers/carts_controller.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" = $2 LIMIT $3  [["cart_id", 12], ["item_id", 14], ["LIMIT", 1]]
---
  def show
    @cart_items = CartItem.all