app/controllers/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items"
---
  def index
    @cart_items = CartItem.all

SELECT "cart_items".* FROM "cart_items"
---
  def show
    @cart_items = CartItem.all

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" = $2  [["cart_id", 12], ["item_id", 17]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
INSERT INTO "cart_items" ("cart_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 12], ["item_id", 19], ["created_at", "2019-09-05 08:01:14.726548"], ["updated_at", "2019-09-05 08:01:14.726548"]]
---
  def create
    item = Item.find(params[:item_id])
    @cart_item_params = @cart.add_item(item)
    @cart_item = @cart.create_or_select_Cart_Item(@cart_item_params)

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def destroy
    @cart = Cart.find(session[:cart_id])