app/controllers/items_controller.rb

SELECT "items".* FROM "items" ORDER BY created_at desc
---
  def index
    @items = Item.all.order("created_at desc")

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "items" SET "description" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["description", "NONONONONONON"], ["updated_at", "2019-09-04 21:19:06.516179"], ["id", 24]]
---
  def update
    @item =Item.find(params[:id])
    @item.update(item_params)

INSERT INTO "items" ("title", "description", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Gogobaby"], ["description", "qkdjdqlfjqdslmfjdslkqf"], ["price", 55.0], ["created_at", "2019-09-04 21:18:56.553919"], ["updated_at", "2019-09-04 21:18:56.553919"], ["user_id", 2]]
---
  def create
    @item = Item.new(item_params)
    @item.user_id = current_user.id
    @item.save

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 24]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def destroy
    Item.find(params[:id]).destroy