app/models/cart.rb

    def create_or_select_Cart_Item(cart_item_params)
      if CartItem.find_by(cart_id: cart_item_params.cart_id, item_id: cart_item_params.item_id) == nil
        @cart_item = CartItem.create(cart_id: cart_item_params.cart_id, item_id: cart_item_params.item_id)
      else
        @cart_item = CartItem.find_by(cart_id: cart_item_params.cart_id, item_id: cart_item_params.item_id)
        @cart_item.update(quantity: @cart_item.quantity + 1)
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" = $2 LIMIT $3  [["cart_id", 12], ["item_id", 17], ["LIMIT", 1]]
INSERT INTO "cart_items" ("cart_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 12], ["item_id", 17], ["created_at", "2019-09-05 08:29:41.511176"], ["updated_at", "2019-09-05 08:29:41.511176"]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" = $2 LIMIT $3  [["cart_id", 12], ["item_id", 20], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 2], ["updated_at", "2019-09-05 09:12:03.728076"], ["id", 13]]