app/models/item.rb

  def not_referenced_by_any_cart_item
  	unless cart_items.empty?
---
SELECT  1 AS one FROM "cart_items" WHERE "cart_items"."item_id" = $1 LIMIT $2  [["item_id", 21], ["LIMIT", 1]]